test/data/xml/hikvision/SetNTP.Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:tds="http://www.onvif.org/ver10/device/wsdl" 
  xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Header>
    <Security s:mustUnderstand="1" 
      xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Username>admin</Username>
        <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">LSl6Ys+TCb/a1c4e5itR04XEKr0=</Password>
        <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">38FYFounRXDPS2zAjko/Ow==</Nonce>
        <Created 
          xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2018-02-13T14:49:20.570Z
        </Created>
      </UsernameToken>
    </Security>
  </s:Header>
  <s:Body>
    <tds:SetNTP>
      <tds:FromDHCP>true</tds:FromDHCP>
    </tds:SetNTP>
  </s:Body>
</s:Envelope>